/*
Самое важное в js: выражения, функции и объекты
Практически все сущности в JS - объекты
Объект "ИМЯ: ЗНАЧЕНИЕ" {}

Массив, функция, число*, строка* - объекты
* - ведут себя как объекты

console.log() - вывод в консоль
console.dir() - отображает все свойства объекта
console.table() - отображает все свойства объекста в табличном виде

Выражение всегда возвращает значение

Имена переменных --------
1. PascalCase (Типы и классы)
2. DB_PASSWORD (Значения известны до запуска приложения и не меняются)
3. camelCase (Все остальные переменные) - чаще всего

Объявление переменных -----------
1. let (изменяемая)
2. const (не изменяемая)
3. var (не рекомендуется)
*/
