/* 
Статическая типизация --------
String a = 'abc'
int b = 10
b = 'xyz' // Error, так как выше мы переменной b дали значение int (числовое)

Динамическая типизация -----------*/
a = 'abc' // String
a = 10 // Number

function b() {
    console.log ('Hey there')
}

b () // 'Hey there'

b = 10

b () // Error, так как ранее 'a' была функцией

// Лучше всего использовать const - позволяет предотвратить возможные проблемы,
// связанные с динамической типизацией

const c = () => {          // стрелочная функция
    console.log('Hey there')
}

c () // 'Hey there'

c = 10 // Error, так как ранее мы объявили 'c' как const